Repository: mozilla-l10n/mt-training-data
Catalog: luo/luo_pontoon.tmx
Source language: en_us
Languages: luo

source: Siswati
luo: Dhosiswati

source: Size
luo: Duong'

source: Skip
luo: kal

source: Skip Submission Feedback
luo: chikri kar chiwo duoko

source: Slovak
luo: Dhoslovak

source: Slovenian
luo: Dhoslovenia

source: Social media
luo: Oinga mag tudruok e mbui

source: Somali
luo: Dhosomali

source: Someone asks for a language to be added.
luo: Ngato kwayo mondo omed dhok moro.

source: Soninke
luo: Dhosonike

source: Sorbian, Lower
luo: Dho josobia ma mwalo

source: Sorbian, Upper
luo: Dhosobia ma malo

source: Sorry, Common Voice is running slowly. Thanks for your interest.
luo: Mos, Common Voice tiyo kata ringo mos. Erokamano kuom bedo gi siso.

source: Sorry, something went wrong
luo: Mos, gimoro ok odhi maber

source: Source of your sentence
luo: Kuma weche owuoke

source: Source: { $source }
luo: Kuma giae: { $source }

source: Southern Kurdish
luo: Kudis ma milambo

source: Southern Sotho
luo: Sotho ma milambo

source: Spanish
luo: Dhospain

source: Speak
luo: Wuo

source: Speakable
luo: Manyalo wachore

source: Speakers
luo: Jomaloso / Jomawuoyo

source: Speaking
luo: Loso

source: Speaking and Listening
luo: Loso kod chiko it

source: Speak in your normal voice! The way you speak is welcome here - we want your accent as it is, and we want your usual volume, style and intonation.
luo: Losi kitiyogi duondi mapile! Wayiegi duondi miwuoyogo pile ka pile - wadwaro duondi kaka en, kendo wadwaro teko mar koko mar duondi kod kit duondi owuogi kaka pile.

source: Speak now
luo: Wuo sani

source: Speak up, contribute here!
luo: Losi, chiu pachi ka!

source: Special Characters and Foreign Letters
luo: Ndiko mopondo kendo mawendo

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
luo: <speechBlogLink>Chak tiegori kod weche teknoloji ma tiyogi duol</speechBlogLink>

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
luo: Duol e yo mawatudore gi jowadwa kendo nonro mar duol kokadho kuom teknologi mar simo mar luedo kod kompiuta miyo mani bedo mayot. Wadwaro tiego jomoloso gige duol e migawoni mondo ofweny weche kod dwonde ka giloko mapiyo e saa mowinjore. Kuom sani thoth duonde nyaka sol kendo ger mondo dhok duto ji oyudre e migawoni kata kamano en chandruok nikech nengo nimalo mar choko duonde. Wageno ni sandug duonde mochok kod Common voice biro miyo jo nonro thuolo mar yango nonro mar duonde in dhok milonygo. Mondo mi yango duol obed gino momako piny ngima, wachoko duonde kuom dhok miyacho malach kachiel kod mago miyacho gi ogendni matin ma nonro madongo osegweyo oko. Ndiko moyangore dhogegi biro konyo jo nonro , johala, kod jogo duto moyango weche duol mondo odin ondamo ma osebedo giwegi

source: Speech-to-text (STT)
luo: Loko weche koe duol

source: Speech-to-text (STT) technologies convert voice data into text.
luo: Teknoloji maloko weche-koe-duol kau duol to lokogi weche mondiki.

source: Split into { $archiveCount } ZIP files containing
luo: pogi e deche { $archiveCount } motingo weche

source: Splits
luo: Pogruok

source: Splits (Age and Sex)
luo: Pogo (Iga kod Chal - dichuo kata dhako)

source: Start recording
luo: Chak mako duol

source: Start typing to describe your accent
luo: Chak ndiko mondo iler kabind duondi

source: Statistics
luo: Kwan / kwano

source: Stats
luo: Kwan

source: Status Page
luo: Oboke mar chalmare

source: Still have questions?
luo: Pod in kod penjo?

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
luo: <strong>Kik iwed duonde machuok ma jomoko omako nikech gin kod kabind duol mopogore ni mari<strong> - nikech duonde ji duto beyo to konyo masinde ng'eyo duonde jiduto.

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
luo: <strong>Ti gi rieko!</strong> Joma wacho dhou biro bedo mopogore kod mamoko, kendo magi mana yore matin manyalo konyou chako.

source: Submission: { $batchId }
luo: Chiwo: { $batchId }

source: Submit
luo: Chiu

source: Submit a report
luo: chiu ripot

source: Submit clips
luo: Or duonde momaki

source: Subscribe
luo: Ndikri

source: Success
luo: Ber

source: Success, profile created!
luo: Ber, kalatas mawuoyo kuomi olosore!

source: Swahili
luo: Dhoswaili

source: Swedish
luo: Dhoswiden

source: Syriac
luo: Dhosiria

source: Tagalog
luo: Dhotagalog

source: Tahitian
luo: Dhotahiti

source: Taiwanese (Minnan)
luo: Dhotawanese ma Minnan

source: Tajik
luo: Dhotajik

source: Taking several attempts to read a word.
luo: Temo dingeny kisomo wach.

source: Tamazight
luo: Dhotamazit

source: Tamil
luo: Dhotamil

source: Tap
luo: Go/mul

source: Tatar
luo: Dhotatar

source: TED-LIUM Corpus
luo: Dero mar TED-LIUM

source: Tell us what you'd like to download:
luo: Nyiswa gima idwaro golo:

source: Telugu
luo: Dhotelugu

source: Terms
luo: Chike

source: Thai
luo: Dhothai

source: Thanks for confirming your account, now let's build your profile.
luo: Erokamano kuom yie ni mae en akaunt mari, koro ndik weche mawuoyo kuomi.

source: Thank you for donating your voice clips!
luo: Erokamano kuom chiwo duondi!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
luo: Erokamano kuom mako duondi!<lineBreak></lineBreak> Koro inyalo ngio gi kendo kaeto ichiu dondi piny ka.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
luo: Erokamano ni chung mar dwaro chiwo pacho ne { $lang }. Watiyo matek mondo waik dhok duto kendo wachoni kanyakla duto weche manyien kokalo kuom barup mbui. Ka idwaro chiwo pachi to chiw barupi mar mbui piny kanyo.

source: Thank you for your voice information
luo: Erokamano kuom chiwo wach duondi

source: Thank you! You’ve sent a new language enquiry
luo: Erokamano! Iseoro kwayo mar dhok manyien

source: The clip has disrespectful or offensive language.
luo: Duol momaki ni otingo weche maonge luor kendo dhok maricho.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
luo: Deche duol mag Common Voice nigi duonde momaki manyalo chopo miche kod alufe, to duonde gi konyo loso teknoloji matiyogi kendo nyalo fwenyo duol.

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
luo: Weche mokan e Common Voice inyalo yudi mayot <licenseLink>CC<licenseLink>ka in kod laisens kuom <datasetLink> kokadho kuom it oboke<datasetLink>.Inyalo bende yudogi kwonde twak mar oganda e it oboke achielno.

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
luo: Kwand seche duondi mosemaki mosepuodhi gi ji 2 kuom ji 3. Magi ikwano e kwand dwaro mar chenroni chopo seche alufu apar.

source: The count of voice recording hours we have collected so far.
luo: Kwand seche duol momaki mawasechoko nyaka sani.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
luo: Gombo Common Voice en ni ng'ato ang'ata nyalo loso teknoloji matiyo gi duol kaka teknoloji manyalo tiego duond ng'ato, kata teknoloji moramora matiyo gi duonde momaki. Teknoloji manyalo loso kaka ndano en achiel kuom teknoloji minyal losi gi deche duol momaki.

source: The number of recordings and which languages you contribute to will be public.
luo: Kwan duonde misemako kod dhok miyie chiurine ibiro ket ayanga.

source: The recording was too long.
luo: Duol momakino ne bor ahinya.

source: The recording was too quiet.
luo: Duol momakino ne ilose mos ahinya.

source: The recording was too short.
luo: Duol momakino ne chiek ahinya.

source: The route was unclear.
luo: Yo ne ok ong'ere maber.

source: The selected file is too large
luo: Sanduk wach miyierono duong ahinya

source: The sentence has a grammatical or spelling error.
luo: Wechegi ok ondik kaka onengo bedi

source: The sentence has disrespectful or offensive language.
luo: Wachno otingo weche maonge luor kendo dhok maricho.

source: The sentence must be grammatically correct.
luo: Wechego nya ndik maber

source: The sentence must be speakable.
luo: Wechego nyaka somre

source: The sentence must be spelled correctly.
luo: Wechego nyaka ndik maber

source: The site is ready to be launched when it reaches 75% completion.
luo: Migaoni biro bedo moikore koselok weche machopo 75% manyiso tieko.

source: The website text is translated into that language.
luo: Weche manie chenroni iloko e dhok no.

source: This is approximately the number of hours required to train a production speech-to-text system.
luo: Magi e seche mag duol momaki madwarore mondo olosgo teknoloji manyalo loko weche koe duol.

source: This is our process for translating and adapting our content for many locales (languages).
luo: Maendi ekaka waloko dhok kod weche manie chenro e dhok mopogore opogore.

source: Three to go!
luo: Adek emodong!

source: Tibetan
luo: Dhotibetan

source: Tigre
luo: Dhotigre

source: Tigrinya
luo: Dhotigrinya

source: Today
luo: Kawuono

source: Today's Common Voice progress on clips recorded
luo: Kaka tij mako duonde osebedo kawuono e Common Voice

source: Today's Common Voice progress on clips validated
luo: Kaka tij puodho duonde osebedo kawuono e Common Voice

source: Today's Progress
luo: Dongruok ma kawuono

source: Toki Pona
luo: Dhotoki ma Pona

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
luo: Mondo duol momaki odonjie deche mar duol mar Common Voice, duol momaki yaka puodhi gi ji ariyo mopogore.

source: Top Contributors
luo: Josolo mangula

source: Total
luo: Duto

source: Total Approved
luo: Duto mosepuodhi

source: { $totalSentences } total sentences.
luo: Kwan { $totalSentences } mag weche.

source: Toward next goal
luo: dhi nyime kichiko okang midwaro

source: Track progress here and on your stats page.
luo: Ngi e wang karatasni kaka idhi nyime

source: Transgender
luo: Oti gath

source: Translate this page
luo: Lok weche manie karatas ni

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
luo: <translateVideoLink>Ngii puonjruok kaka itiyo kod Pontoon.</translateVideoLink>

source: Translating the site
luo: Loko weche manie migawoni

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
luo: Loko migao mar Common Voice <strong>pontoon</strong>.

source: Tshivenda
luo: Dhoshivenda

source: Turkish
luo: Dhotaki

source: Turkmen
luo: Dhotukmen

source: Tuvan
luo: Dhotuvan

source: Twi
luo: Dhotwi

source: Ubykh
luo: Dho Ubik

source: Udmurt
luo: Dhoudmat

source: Ukrainian
luo: Dhoukrainia

source: Understand contribution criteria
luo: Winj maber chenro mag chiuruok

source: Unexpected response returned from server
luo: Duoko mopogore kowuok kuom sava

source: Updating…
luo: Medo weche manyien...

source: Upload aborted. Do you want to delete your recordings?
luo: Kano weche otamre. Idwaro rucho duonde misemako?

source: Upload an image file
luo: Ket picha

source: Upload <icon></icon> public domain sentences
luo: Ket <icon></icon> weche moae aluora ma galamoro

source: Upload of this clip keeps failing at server. Reload the page or try again later.
luo: Keto vidio machuokni osiko tamore e sava. Tem kendo

source: Upload of this clip keeps failing, keep retrying?
luo: Keto vidio machuokni osiko tamore, med temo?

source: Urdu
luo: Dhourdu

source: User Name
luo: Nying mar tich

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
luo: Jomoko puodho ber mar duonde momaki, kagi nono ka ng'ama ne osomo wach be nosome maber.

source: Using Common Voice
luo: Tiyo kod Common Voice

source: Uyghur
luo: Dhougu

source: Uzbek
luo: Dhouzbek

source: Validated Clips
luo: Duonde mopuodhi

source: Validated Hours
luo: Seche mosepuodhi

source: Validated Hr. Total
luo: Kwan seche duto mosenon

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
luo: Nono duonde momaki bende ber ahinya kaluwore kod gombo mar Common Voice. Yie ikaw thuolo ichik iti kendo ikonywa loso kwan duonde maler ma oganda nyalo tiyogo.

source: Validation Progress
luo: Kaka nono dhi nyime

source: Validations
luo: mopuodhi

source: Value and recognition.
luo: Nengo kendo ngeyo.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
luo: Kabind duonde gin kit dhok, kuom ranyisi kaka dho joma odak kanyachiel kata e gweng'. Sechemoko iluongo gi ni dhoudi.

source: Varying Pronunciations
luo: Kit somo dhok opogore

source: Venetian
luo: Dhovenetia

source: Version
luo: Loko mopogore

source: Vietnamese
luo: Dhovietnam

source: View your progress against personal and project goals.
luo: Ne dongruok mari to pime gi chenro mari miketo mar tiyo kod dongruok madwarore e chenroni.

source: Visible
luo: Mineno

source: Voice clips are entered into a submission queue that readies them for listening.
luo: Duonde mosemaki iketo e riedo maikogi ne joma biro winjogi.

source: Voice Collection
luo: Choko dwol / Choko duonde

source: Voice Contribution
luo: Choko duonde

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
luo: Duol en gima omi dhano nono, Duol en mar dhano. Mano emomiyo wamor kuom loso teknologi matiyo gi duol e masinde. To mondo walos teknologi ma tiyo gi duol, duond ji mangeny mochoki dwarore.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
luo: Duol en gima omi dhano nono, Duol en mar dhano. Mano emomiyo wamor kuom loso teknologi matiyo gi duol e masinde. To mondo walos teknologi ma tiyo gi duol, duond ji mangeny mochoki dwarore.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
luo: Duol loko kaka watimo tundruok kod masinde, to e sani masindego bechgi ni malo kendo nyiewo gi tek. Comon voice kowuok e riuwruk mar Mozilla koro konyoduonde fwenyo yot kendo ber ni duondegi chopo ne oganda malach. Comon voice ber e choko kendo kano weche mathoth ahinya mag duonde e piny ngima. Gitimo ma e dhok miwacho e pinje duto.

source: Voices Online Now
luo: Dwol e intanet koro

source: Voice Validation
luo: Puotho duol

source: Volume
luo: koko

source: Votic
luo: Dhovotik

source: Want to stay in touch with Common Voice?
luo: Idwaro ni mondo imed tutori kod Common Voice?

source: Watch our video explainer to help
luo: Tem ingianena wechewago mondo okonyi

source: Wayuunaiki
luo: Dhowayuunaiki

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
luo: Wagero deche duol momaki moyangore ne oganda kendo ji duto nyalo tiyogo tiego teknoloji matiyo gi dhok mopogore opogore.

source: We are going out to get a coffee.
luo: wadhi madho kahawa oko.

source: We are going out to get coffee.
luo: Wadhi madho kahawa oko.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
luo: Wan kaka Mozila wagero achiel mar oganda mar puoth kuom dwol. Wagombo bedo e tudruok kuom weche manyien, kod deche manyien kendo winjo mamoko kuom kaka itiyo gi dechego

source: Website Localization
luo: Loko weche manie chenroni

source: We could not fetch the stats. Please try again later.
luo: Neok wanyal yudo kwan. Tem kendo bange.

source: We couldn’t find that page for you
luo: Ne ok wany yudo wang kalatasno ne in

source: We couldn’t get any audio clips for you to listen to. Please try again later.
luo: Nok wanyal yudoni duonde momaki minyalo chike iti. Wakwayo ni item kendo bange.

source: We couldn’t get any sentences for you to speak. Please try again later.
luo: Neokwanyal yudoni weche minyalo wacho. Wakwayo ni item kendo bange.

source: Weekly
luo: Juma ka juma

source: Weekly Goal
luo: Chenro maag tiyo juma ka juma

source: We launch the Common Voice site in this language.
luo: Wayao chenro e Common Voice ne dhok ni.

source: Welcome { $company } staff!
luo: Ruako jotij { $company }

source: Welcome to Common Voice
luo: Waruaki Common Voice

source: Welcome to the Common Voice Sentence Collector
luo: waruaki e choko weche e Common Voice

source: Welsh
luo: dhowels

source: We may have run out of clips - refresh the page, or try again later.
luo: Nenore ni watieko duonde momaki - temane yao kalatas kendo kata ang item bange.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
luo: Wasingo ni wabiro rito weche moa kuomi kod ritruok. Som mathoth koa <privacyLink>Weche ma ng'ato owuon onego ng'e</privacyLink>.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
luo: Wagero deche duol momaki motingo duonde mopogore moyangore ne oganda kendo ji duto nyalo tiyogo tiego teknoloji matiyo gi dhok mopogore opogore.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
luo: Wakwayo ji duto mondo ochiure ne loso deche moyangore mag duol momaki. Chiu duondi, puodh duonde momaki gi jomoko, ket deche obed maber ne ji duto.

source: We’re experiencing unexpected downtime
luo: Chenro ok nyal yudore gisani.

source: We’re going out to get coffee.
luo: wadhi madho kahawa oko

source: We release the dataset every 3 months.
luo: Wayao deche mag weche dweche adek ka dweche adek.

source: We're receiving a lot of traffic and are currently investigating the issues.
luo: Wayudo ji mathoth ahinya kendo wayongo tiend gima kelo mano.

source: We’re sorry, your platform is not currently supported.
luo: Watimo mos, migawo mitiyogono ok nyalre.

source: Western Sierra Puebla Nahuatl
luo: Dho jomeksiko

source: Westphalian
luo: Dhowestfalia

source: We've run out of sentences to record in this language...
luo: Wasetieko weche e dhokni minyalo maki...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
luo: Wadwaro ni mondo teknoloji matiyo gi duol oti maber gi duonde mopogore opogore. Nikech ma, deche mag duonde nyaka bed gi ji moa e kuonde mopogore.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
luo: Wabiro bende <strong>nyiso jatendwa mochungne migawono mondo onge ni idwa tiyo kodgi</strong>, mondo gimiyi kony minyalo dwaro.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
luo: Wabiro tudore kodi machiegni gi weche mamoko kaka inyalo medo dhou e chenro mar Common Voice.

source: We will be in touch with more information as it becomes available.
luo: wabiro bedo etudruok gi weche manyien kaka gidonjo

source: We will not make your email public.
luo: Ok wabiketo barupi mar mbui ayanga.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
luo: Tiende nango kiwacho ni ok anyal "fwenyo" joma chiwo duodgi ne deche mag Common Voice?

source: What is a language on Common Voice?
luo: Dhok en ango e Common Voice?

source: What is Common Voice?
luo: Komon Vois en ango?

source: What issues are you experiencing with this sentence?
luo: En weche mage maiyudo kuom wechego?

source: What kind of goal do you want to build?
luo: Ere kaka idwaro tiyo?

source: What level of audio quality is required for a voice clip to be used in the dataset?
luo: Ranginy mane midwaro e duol momaki mondo duolno otigodo e deche?

source: What sentences can I add?
luo: Weche mage matong amedi?

source: What’s inside the Common Voice dataset?
luo: Ango manitie ei deche duol mag Common Voice?

source: What's Public?
luo: Angoma nitie e ayanga?

source: What’s the difference between Common Voice and Deep Speech?
luo: Ere pogruok manie kind Common Voice kod Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
luo: Ka ngato okwero duol momaki to iduoke e laini. Ka duolno okwed mar ariyo gi ng'at machielo, igole to itere e liendi duol.

source: When will you release Common Voice data in other languages?
luo: Karang'o mibiro gol weche kod duonde manie Common voice e dhok moko?

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
luo: Wechegi manie <wikipediaLink>aluora ma galamoro</wikipediaLink> owuok kange?

source: Where does the source text come from?
luo: Ere kuma weche go duto wuokie?

source: Which variant of { $language } do you speak?
luo: Iwacho loko mar dholuo mane?

source: Why ?
luo: Nango?

source: Why a profile?
luo: Angomomiyo ibed gi kumindike weche mawuoyo kuomi?

source: Why are you asking?
luo: Ango momiyo ipenjo?

source: Why Common Voice?
luo: Ango momiyo Common Voice?

source: Why does this matter?
luo: Ma omaki kod ango?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
luo: Ok upenj ji mondo osom buge kata ndiko manie Wikipedia kuom dhok mopogore opogore?

source: Why do you need so many different speakers per language?
luo: Angomomiyo udwaro ji mangeny mawacho dhok ka dhok?

source: Why is 10,000 validated hours the per language goal for capturing audio?
luo: Angomomiyo idwaro dhok ka dhok ochop seche 10,000 mar duol momaki?

source: Why is Common Voice part of the Mozilla mission?
luo: Ang'o momiyo Common voice en achiel mar tije ma Mozilla timo?
